Repository: ZulfukorPerdeshov/symphony_erm_app
Catalog: lib/l10n/app_*.arb
Languages: uz

source: Loading...
uz: Yuklanmoqda...

source: Retry
uz: Qayta urinish

source: Cancel
uz: Bekor qilish

source: Save
uz: Saqlash

source: Delete
uz: O'chirish

source: Edit
uz: Tahrirlash

source: Add
uz: Qo'shish

source: Search
uz: Qidirish

source: Filter
uz: Filtr

source: Refresh
uz: Yangilash

source: Yes
uz: Ha

source: No
uz: Yo'q

source: Close
uz: Yopish

source: Login
uz: Kirish

source: Logout
uz: Chiqish

source: Email
uz: Elektron pochta

source: Password
uz: Parol

source: Forgot Password?
uz: Parolni unutdingizmi?

# loginError
source: Login failed. Please check your credentials.
uz: Kirish xatoligi. Ma'lumotlaringizni tekshiring.

# logoutConfirm
source: Are you sure you want to logout?
uz: Rostdan ham chiqishni istaysizmi?

# emailRequired
source: Email is required
uz: Elektron pochta talab qilinadi

# passwordRequired
source: Password is required
uz: Parol talab qilinadi

# invalidEmail
source: Please enter a valid email address
uz: To'g'ri elektron pochta manzilini kiriting

# passwordTooShort
source: Password must be at least 6 characters long
uz: Parol kamida 6 ta belgidan iborat bo'lishi kerak

source: Home
uz: Bosh sahifa

source: Warehouse
uz: Ombor

source: Orders
uz: Buyurtmalar

source: Production
uz: Ishlab chiqarish

source: Tasks
uz: Vazifalar

source: Profile
uz: Profil

source: Notifications
uz: Bildirishnomalar

source: Analytics
uz: Tahlil

source: Settings
uz: Sozlamalar

# networkError
source: Network error. Please check your connection.
uz: Tarmoq xatoligi. Internet ulanishini tekshiring.

# serverError
source: Server error. Please try again later.
uz: Server xatoligi. Keyinroq urinib ko'ring.

# unknownError
source: An unknown error occurred.
uz: Noma'lum xatolik yuz berdi.

# unauthorizedError
source: Session expired. Please login again.
uz: Sessiya tugadi. Qayta kiring.

source: Inventory
uz: Inventar

source: Stock Items
uz: Ombordagi tovarlar

source: Stock Level
uz: Zaxira darajasi

source: Low Stock
uz: Kam zaxira

source: Out of Stock
uz: Mavjud emas

source: In Stock
uz: Mavjud

source: Add Product
uz: Mahsulot qo'shish

source: Edit Product
uz: Mahsulotni tahrirlash

source: Product Name
uz: Mahsulot nomi

# productNameRequired
source: Product name is required
uz: Mahsulot nomi talab qilinadi

source: Product Description
uz: Mahsulot tavsifi

# productSKU
source: SKU
uz: Artikul

# productCategory
source: Category
uz: Kategoriya

# productPrice
source: Price
uz: Narx

source: Quantity
uz: Miqdor

# minimumStock
source: Minimum Stock Level
uz: Minimal zaxira darajasi

source: Unit
uz: O'lchov birligi

source: Stock Adjustment
uz: Zaxira tuzatishi

source: Adjustment Reason
uz: Tuzatish sababi

source: Notes
uz: Izohlar

source: Order Number
uz: Buyurtma raqami

source: Customer
uz: Mijoz

source: Order Date
uz: Buyurtma sanasi

source: Total Amount
uz: Umumiy summa

source: Order Status
uz: Buyurtma holati

source: Shipping Address
uz: Yetkazib berish manzili

source: Order Items
uz: Buyurtmadagi tovarlar

source: Confirm Order
uz: Buyurtmani tasdiqlash

source: Process Order
uz: Buyurtmani qayta ishlash

source: Ship Order
uz: Buyurtmani jo'natish

source: Cancel Order
uz: Buyurtmani bekor qilish

source: Tracking Number
uz: Kuzatuv raqami

source: Production Order
uz: Ishlab chiqarish buyurtmasi

source: Production Stage
uz: Ishlab chiqarish bosqichi

source: Production Task
uz: Ishlab chiqarish vazifasi

source: Start Production
uz: Ishlab chiqarishni boshlash

source: Complete Production
uz: Ishlab chiqarishni yakunlash

source: Production Status
uz: Ishlab chiqarish holati

source: Due Date
uz: Bajarish muddati

source: Assigned To
uz: Tayinlangan

source: Progress
uz: Jarayon

source: Requirements
uz: Talablar

source: Pending
uz: Kutilmoqda

source: Confirmed
uz: Tasdiqlangan

source: Processing...
uz: Ishlanmoqda...

source: Ready
uz: Tayyor

source: Shipped
uz: Jo'natildi

source: Delivered
uz: Yetkazildi

source: Cancelled
uz: Bekor qilindi

source: Returned
uz: Qaytarildi

source: In Progress
uz: Jarayonda

source: Completed
uz: Yakunlandi

source: On Hold
uz: To'xtatilgan

source: Not Started
uz: Boshlanmagan

source: Priority
uz: Muhimlik

source: Low
uz: Past

source: Medium
uz: O'rta

source: High
uz: Yuqori

source: Urgent
uz: Shoshilinch

source: First Name
uz: Ism

source: Last Name
uz: Familiya

source: Full Name
uz: To'liq ism

source: Phone Number
uz: Telefon raqami

source: Address
uz: Manzil

source: City
uz: Shahar

source: State
uz: Viloyat

source: ZIP Code
uz: Pochta indeksi

source: Country
uz: Mamlakat

source: Change Password
uz: Parolni o'zgartirish

source: Current Password
uz: Joriy parol

source: New Password
uz: Yangi parol

source: Confirm Password
uz: Parolni tasdiqlang

source: Passwords do not match
uz: Parollar mos kelmaydi

source: Password changed successfully
uz: Parol muvaffaqiyatli o'zgartirildi

source: Update Profile
uz: Profilni yangilash

source: Upload Avatar
uz: Avatar yuklash

source: Remove Avatar
uz: Avatarni o'chirish

source: Profile updated successfully
uz: Profil muvaffaqiyatli yangilandi

source: Mark as Read
uz: O'qilgan deb belgilash

source: Mark All as Read
uz: Hammasini o'qilgan deb belgilash

source: Delete Notification
uz: Bildirishnomani o'chirish

source: Clear All Notifications
uz: Barcha bildirishnomalarni tozalash

source: Notification Preferences
uz: Bildirishnoma sozlamalari

source: Language
uz: Til

source: Theme
uz: Mavzu

# lightTheme
source: Light
uz: Yorqin

# darkTheme
source: Dark
uz: Qorong'i

# systemTheme
source: System
uz: Tizim

# todayTasks
source: Today's Tasks
uz: Bugungi vazifalar

source: Ongoing Tasks
uz: Davom etayotgan vazifalar

source: Task Overview
uz: Vazifalar ko'rinishi

source: Total Tasks
uz: Jami vazifalar

source: Total Due
uz: Jami bajarilishi kerak

source: Unique Tasks
uz: Noyob vazifalar

# monthlyView
source: Monthly
uz: Oylik

# weeklyView
source: Weekly
uz: Haftalik

# dailyView
source: Daily
uz: Kunlik

# allActivitiesInOnePlace
source: All your activities in one place
uz: Barcha faoliyatingiz bir joyda

# theHomeScreenGivesUsers
source: The Home Screen gives users a clear, quick overview of their day. It displays high-priority tasks, upcoming deadlines, and recent team
uz: Bosh sahifa foydalanuvchilarga kunning aniq va tezkor ko'rinishini beradi. U yuqori ustuvorlikdagi vazifalar, yaqinlashayotgan muddatlar va so'nggi jamoa faoliyatini ko'rsatadi

source: Hello
uz: Salom

source: Welcome
uz: Xush kelibsiz

source: Good Morning
uz: Xayrli tong

source: Good Afternoon
uz: Xayrli kun

source: Good Evening
uz: Xayrli kech

source: Data loaded successfully
uz: Ma'lumotlar muvaffaqiyatli yuklandi

source: No data available
uz: Ma'lumot mavjud emas

source: Pull to refresh
uz: Yangilash uchun torting

source: Load more
uz: Ko'proq yuklash

source: Warehouses
uz: Omborlar

source: Warehouses List
uz: Omborlar ro'yxati

source: Warehouse Details
uz: Ombor tafsilotlari

source: Warehouse Name
uz: Ombor nomi

source: Warehouse Code
uz: Ombor kodi

source: Warehouse Type
uz: Ombor turi

source: Location
uz: Joylashuv

source: Capacity
uz: Sig'im

source: Current Occupancy
uz: Joriy bandlik

source: Manager
uz: Menejer

source: Status
uz: Holat

source: Active
uz: Faol

source: Inactive
uz: Faol emas

source: Description
uz: Tavsif

source: Products
uz: Mahsulotlar

source: Product List
uz: Mahsulotlar ro'yxati

source: Product Details
uz: Mahsulot tafsilotlari

source: SKU
uz: Artikul

source: Category
uz: Kategoriya

source: Price
uz: Narx

source: Stock
uz: Zaxira

source: Stock Quantity
uz: Zaxira miqdori

source: Current Stock
uz: Joriy zaxira

source: Minimum Stock Level
uz: Minimal zaxira darajasi

source: Stock Status
uz: Zaxira holati

source: Stock Taking
uz: Zaxirani inventarizatsiya qilish

source: Stock Transfer
uz: Zaxirani ko'chirish

source: Stock Transfer List
uz: Zaxira ko'chirishlari ro'yxati

source: New Count
uz: Yangi sanoq

source: History
uz: Tarix

source: Select Location
uz: Joyni tanlang

source: Select Product
uz: Mahsulotni tanlang

# chooseProduct
source: Choose a product
uz: Mahsulotni tanlang

# chooseLocation
source: Choose a location
uz: Joyni tanlang

source: Count Products
uz: Mahsulotlarni sanash

source: Counted
uz: Sanaldi

source: System
uz: Tizim

source: Discrepancies
uz: Nomuvofiqliklar

# noProductsFound
source: No products found for this location
uz: Bu joy uchun mahsulotlar topilmadi

# pleaseCountAtLeastOne
source: Please count at least one product
uz: Kamida bitta mahsulotni saning

# stockTakingCompleted
source: Stock taking completed successfully
uz: Inventarizatsiya muvaffaqiyatli yakunlandi

source: No stock takings found
uz: Inventarizatsiyalar topilmadi

source: Error loading stock takings
uz: Inventarizatsiyalarni yuklashda xato

source: Submit Stock Count
uz: Sanalni yuborish

source: Quantity Change
uz: Miqdor o'zgarishi

# enterQuantity
source: Enter quantity (+ for increase, - for decrease)
uz: Miqdorni kiriting (+ oshirish, - kamaytirish uchun)

# usePositiveNumbers
source: Use positive numbers to increase stock, negative to decrease
uz: Zaxirani oshirish uchun musbat, kamaytirish uchun manfiy raqamlardan foydalaning

# selectReason
source: Select reason for adjustment
uz: Tuzatish sababini tanlang

source: Physical Count Correction
uz: Jismoniy sanoq tuzatishi

source: Damaged Goods
uz: Shikastlangan tovarlar

source: Expired Products
uz: Muddati o'tgan mahsulotlar

source: Theft/Loss
uz: O'g'irlik/Yo'qotish

source: Return to Supplier
uz: Yetkazib beruvchiga qaytarish

source: Quality Control Rejection
uz: Sifat nazorati rad etishi

source: System Error Correction
uz: Tizim xatosini tuzatish

source: Other
uz: Boshqa

source: Notes (Optional)
uz: Izohlar (Ixtiyoriy)

# addNotes
source: Add any additional notes or comments
uz: Qo'shimcha izohlar yoki sharhlar qo'shing

source: Adjust Stock
uz: Zaxirani tuzatish

# stockAdjustmentCompleted
source: Stock adjustment completed successfully
uz: Zaxira tuzatishi muvaffaqiyatli yakunlandi

source: Error adjusting stock
uz: Zaxirani tuzatishda xato

# pleaseSelectProduct
source: Please select a product
uz: Mahsulotni tanlang

# pleaseSelectReason
source: Please select a reason
uz: Sababni tanlang

# pleaseEnterQuantity
source: Please enter quantity change
uz: Miqdor o'zgarishini kiriting

# pleaseEnterValidNumber
source: Please enter a valid number
uz: To'g'ri raqam kiriting

# quantityCannotBeZero
source: Quantity change cannot be zero
uz: Miqdor o'zgarishi nolga teng bo'lishi mumkin emas

# cannotReduceBelowZero
source: Cannot reduce stock below zero
uz: Zaxirani noldan pastga kamaytirish mumkin emas

source: Current Stock Information
uz: Joriy zaxira ma'lumoti

source: Current
uz: Joriy

source: Minimum
uz: Minimal

source: Error loading products
uz: Mahsulotlarni yuklashda xato

source: Error loading locations
uz: Joylarni yuklashda xato

source: From Location
uz: Qayerdan

source: To Location
uz: Qayerga

source: Transfer Quantity
uz: Ko'chirish miqdori

source: Select from location
uz: Qayerdan joyni tanlang

source: Select to location
uz: Qayerga joyni tanlang

# enterTransferQuantity
source: Enter quantity to transfer
uz: Ko'chirish miqdorini kiriting

source: Please select from location
uz: Qayerdan joyni tanlang

source: Please select to location
uz: Qayerga joyni tanlang

source: Please enter transfer quantity
uz: Ko'chirish miqdorini kiriting

# locationsCannotBeSame
source: From and To locations cannot be the same
uz: Qayerdan va Qayerga joylari bir xil bo'lishi mumkin emas

# insufficientStock
source: Insufficient stock at source location
uz: Manba joyida zaxira yetarli emas

source: Create Transfer
uz: Ko'chirishni yaratish

# stockTransferCreated
source: Stock transfer created successfully
uz: Zaxira ko'chirishi muvaffaqiyatli yaratildi

# errorCreatingTransfer
source: Error creating stock transfer
uz: Zaxira ko'chirishini yaratishda xato

source: All Statuses
uz: Barcha holatlar

source: No transfers found
uz: Ko'chirishlar topilmadi

# completeTransfer
source: Complete
uz: Yakunlash

# cancelTransfer
source: Cancel
uz: Bekor qilish

# transferCompleted
source: Transfer completed successfully
uz: Ko'chirish muvaffaqiyatli yakunlandi

# transferCancelled
source: Transfer cancelled successfully
uz: Ko'chirish muvaffaqiyatli bekor qilindi

source: Error completing transfer
uz: Ko'chirishni yakunlashda xato

source: Error cancelling transfer
uz: Ko'chirishni bekor qilishda xato

# cancelTransferTitle
source: Cancel Transfer
uz: Ko'chirishni bekor qilish

# provideCancellationReason
source: Please provide a reason for cancelling this transfer:
uz: Ushbu ko'chirishni bekor qilish sababini ko'rsating:

source: Cancellation reason
uz: Bekor qilish sababi

source: Confirm
uz: Tasdiqlash

source: Date
uz: Sana

source: Created By
uz: Kim tomonidan yaratilgan

source: Total Value
uz: Umumiy qiymat

# addNotesAboutStockTaking
source: Add any notes about the stock taking
uz: Inventarizatsiya haqida izohlar qo'shing

# warehousesNotFound
source: No warehouses found
uz: Omborlar topilmadi

source: Error loading warehouses
uz: Omborlarni yuklashda xato

source: Search by order number or customer...
uz: Buyurtma raqami yoki mijoz bo'yicha qidirish...

source: All
uz: Barchasi

source: Draft
uz: Qoralama

source: Total
uz: Jami

source: Revenue
uz: Daromad

source: Items
uz: Tovarlar

source: No orders found
uz: Buyurtmalar topilmadi

source: Error loading orders
uz: Buyurtmalarni yuklashda xato

source: Order moved to processing
uz: Buyurtma qayta ishlashga o'tkazildi

source: Error processing order
uz: Buyurtmani qayta ishlashda xato

source: Enter tracking number (optional):
uz: Kuzatuv raqamini kiriting (ixtiyoriy):

source: Ship
uz: Jo'natish

source: Order shipped successfully
uz: Buyurtma muvaffaqiyatli jo'natildi

source: Error shipping order
uz: Buyurtmani jo'natishda xato

source: Order Information
uz: Buyurtma ma'lumoti

source: Total Items
uz: Jami tovarlar

source: Subtotal
uz: Oraliq summa

source: Discount
uz: Chegirma

source: Paid Amount
uz: To'langan summa

source: Customer Information
uz: Mijoz ma'lumoti

source: Customer ID
uz: Mijoz ID

source: Delivery Information
uz: Yetkazib berish ma'lumoti

source: Delivery Type
uz: Yetkazib berish turi

source: Delivery Status
uz: Yetkazib berish holati

source: Delivery Price
uz: Yetkazib berish narxi

source: Receiver
uz: Qabul qiluvchi

source: Receiver Phone
uz: Qabul qiluvchi telefoni

source: Order Summary
uz: Buyurtma xulosasi

source: Details
uz: Tafsilotlar

source: No items found
uz: Tovarlar topilmadi

source: Debug Order
uz: Buyurtmani tekshirish

source: Unit Price
uz: Birlik narxi

source: No history available
uz: Tarix mavjud emas

source: Changed by
uz: Kim tomonidan o'zgartirilgan

source: Tracking
uz: Kuzatuv

source: Actions
uz: Amallar

source: Error refreshing order
uz: Buyurtmani yangilashda xato

source: Error loading order history
uz: Buyurtma tarixini yuklashda xato

source: Order Operations
uz: Buyurtma operatsiyalari

# acceptAndConfirmOrder
source: Accept and confirm this order
uz: Ushbu buyurtmani qabul qiling va tasdiqlang

# moveToProcessing
source: Move order to processing status
uz: Buyurtmani qayta ishlash holatiga o'tkazing

source: Mark as Ready
uz: Tayyor deb belgilash

# markOrderReadyForShipping
source: Mark order as ready for shipping
uz: Buyurtmani jo'natish uchun tayyor deb belgilang

# shipOrderWithTracking
source: Ship order with tracking information
uz: Buyurtmani kuzatuv ma'lumoti bilan jo'nating

source: Mark as Delivered
uz: Yetkazildi deb belgilash

source: Mark order as delivered
uz: Buyurtmani yetkazildi deb belgilang

# cancelOrderWithReason
source: Cancel this order with reason
uz: Ushbu buyurtmani sabab ko'rsatib bekor qiling

# processReturnForOrder
source: Process return for this order
uz: Ushbu buyurtma uchun qaytarishni qayta ishlang

# noOperationsAvailable
source: No operations available for this order
uz: Ushbu buyurtma uchun operatsiyalar mavjud emas

source: Add confirmation notes (optional):
uz: Tasdiqlash izohlarini qo'shing (ixtiyoriy):

source: Add processing notes (optional):
uz: Qayta ishlash izohlarini qo'shing (ixtiyoriy):

source: Add shipping notes
uz: Jo'natish izohlarini qo'shing

source: Add delivery notes (optional):
uz: Yetkazib berish izohlarini qo'shing (ixtiyoriy):

source: Customer Request
uz: Mijoz so'rovi

source: Payment Issues
uz: To'lov muammolari

source: Address Issues
uz: Manzil muammolari

source: System Error
uz: Tizim xatosi

source: Duplicate Order
uz: Takroriy buyurtma

source: Quality Concerns
uz: Sifat muammolari

source: Additional Notes
uz: Qo'shimcha izohlar

source: Add cancellation details
uz: Bekor qilish tafsilotlarini qo'shing

source: Return Reason
uz: Qaytarish sababi

source: Defective Product
uz: Nuqsonli mahsulot

source: Wrong Item Sent
uz: Noto'g'ri tovar yuborilgan

source: Customer Dissatisfaction
uz: Mijoz noroziligi

source: Size/Fit Issues
uz: O'lcham/Mos kelish muammolari

source: Damaged During Shipping
uz: Jo'natish paytida shikastlangan

source: Changed Mind
uz: Fikrini o'zgartirdi

source: Quality Issues
uz: Sifat muammolari

source: Return Details
uz: Qaytarish tafsilotlari

source: Add return processing details
uz: Qaytarishni qayta ishlash tafsilotlarini qo'shing

source: Operation completed successfully
uz: Operatsiya muvaffaqiyatli yakunlandi

# continueButton
source: Continue
uz: Davom etish

source: Error loading task details
uz: Vazifa tafsilotlarini yuklashda xato

source: Comments
uz: Sharhlar

source: Attachments
uz: Qo'shimcha fayllar

source: Task Information
uz: Vazifa ma'lumoti

source: Duration
uz: Davomiyligi

source: Not available
uz: Mavjud emas

source: Estimated Hours
uz: Taxminiy soatlar

source: Actual Hours
uz: Haqiqiy soatlar

source: Assignment
uz: Tayinlash

source: Assigned User
uz: Tayinlangan foydalanuvchi

source: Assigned Role
uz: Tayinlangan rol

source: Not assigned
uz: Tayinlanmagan

source: Timeline
uz: Vaqt chizig'i

source: Planned Start
uz: Rejalashtirilgan boshlanish

source: Planned End
uz: Rejalashtirilgan tugash

source: Actual Start
uz: Haqiqiy boshlanish

source: Actual End
uz: Haqiqiy tugash

source: Created
uz: Yaratilgan

source: Updated
uz: Yangilangan

source: Task Actions
uz: Vazifa amallar

source: Start Task
uz: Vazifani boshlash

source: Update Progress
uz: Jarayonni yangilash

source: Complete
uz: Yakunlash

source: Cancel Task
uz: Vazifani bekor qilish

source: Task Completed
uz: Vazifa yakunlandi

source: Task Cancelled
uz: Vazifa bekor qilindi

source: Task started successfully
uz: Vazifa muvaffaqiyatli boshlandi

source: Error starting task
uz: Vazifani boshlashda xato

source: Complete Task
uz: Vazifani yakunlash

# areYouSureCompleteTask
source: Are you sure you want to mark this task as completed?
uz: Ushbu vazifani yakunlandi deb belgilashga ishonchingiz komilmi?

source: Actual Hours (optional)
uz: Haqiqiy soatlar (ixtiyoriy)

source: Completion Notes (optional)
uz: Yakunlash izohlar (ixtiyoriy)

source: Task completed successfully
uz: Vazifa muvaffaqiyatli yakunlandi

source: Error completing task
uz: Vazifani yakunlashda xato

# cancelTaskConfirm
source: Cancel Task
uz: Vazifani bekor qilish

# areYouSureCancelTask
source: Are you sure you want to cancel this task? This action cannot be undone.
uz: Ushbu vazifani bekor qilishga ishonchingiz komilmi? Ushbu harakatni qaytarib bo'lmaydi.

# pleaseProvideCancellationReason
source: Please provide a cancellation reason
uz: Iltimos, bekor qilish sababini ko'rsating

source: Task cancelled successfully
uz: Vazifa muvaffaqiyatli bekor qilindi

source: Error cancelling task
uz: Vazifani bekor qilishda xato

# progressPercentage
source: Progress Percentage (0-100)
uz: Jarayon foizi (0-100)

source: Progress Notes (optional)
uz: Jarayon izohlar (ixtiyoriy)

# pleaseEnterValidProgress
source: Please enter a valid progress percentage (0-100)
uz: Iltimos, to'g'ri jarayon foizini kiriting (0-100)

source: Update
uz: Yangilash

source: Progress updated successfully
uz: Jarayon muvaffaqiyatli yangilandi

source: Error updating progress
uz: Jarayonni yangilashda xato

source: No comments yet
uz: Hali sharhlar yo'q

source: No attachments
uz: Qo'shimcha fayllar yo'q

source: Internal
uz: Ichki

source: Uploaded by
uz: Kim tomonidan yuklangan

# fileDownloadNotImplemented
source: File download not implemented yet
uz: Faylni yuklash hali amalga oshirilmagan

source: Unknown
uz: Noma'lum

source: Task is overdue
uz: Vazifa muddati o'tib ketgan

source: Low Stock Products
uz: Kam zaxirali mahsulotlar

source: Search products...
uz: Mahsulotlarni qidirish...

source: All Categories
uz: Barcha kategoriyalar

source: No low stock products found
uz: Kam zaxirali mahsulotlar topilmadi

source: Add First Product
uz: Birinchi mahsulotni qo'shish

source: Error loading data
uz: Ma'lumotlarni yuklashda xato

source: Basic Information
uz: Asosiy ma'lumot

# descriptionRequired
source: Description is required
uz: Tavsif talab qilinadi

# skuRequired
source: SKU is required
uz: Artikul talab qilinadi

# unitRequired
source: Unit is required
uz: O'lchov birligi talab qilinadi

source: Select Category
uz: Kategoriyani tanlang

source: Pricing
uz: Narxlash

# unitPriceLabel
source: Unit Price
uz: Birlik narxi

# priceRequired
source: Price is required
uz: Narx talab qilinadi

# pleaseEnterValidPrice
source: Please enter a valid price
uz: To'g'ri narx kiriting

source: Stock Information
uz: Zaxira ma'lumoti

source: Initial Stock
uz: Boshlang'ich zaxira

# stockQuantityRequired
source: Stock quantity is required
uz: Zaxira miqdori talab qilinadi

# pleaseEnterValidQuantity
source: Please enter a valid quantity
uz: To'g'ri miqdor kiriting

# minimumStockRequired
source: Minimum stock is required
uz: Minimal zaxira talab qilinadi

# pleaseEnterValidMinimumStock
source: Please enter a valid minimum stock
uz: To'g'ri minimal zaxira kiriting

# minimumStockAlertInfo
source: Minimum stock level is used to trigger low stock alerts
uz: Minimal zaxira darajasi kam zaxira haqida ogohlantirishni ishga tushirish uchun ishlatiladi

source: Creating Product...
uz: Mahsulot yaratilmoqda...

source: Create Product
uz: Mahsulot yaratish

source: Product created successfully
uz: Mahsulot muvaffaqiyatli yaratildi

source: Error creating product
uz: Mahsulotni yaratishda xato

source: Error loading categories
uz: Kategoriyalarni yuklashda xato

source: Search warehouses...
uz: Omborlarni qidirish...

# noWarehousesMatchSearch
source: No warehouses match your search
uz: Qidiruvga mos omborlar topilmadi

# managerLabel
source: Manager
uz: Menejer

source: Raw Materials
uz: Xom ashyo

source: Search stock items...
uz: Zaxira elementlarini qidirish...

source: No stock items found
uz: Zaxira elementlari topilmadi

# noStockItemsMatchSearch
source: No stock items match your search
uz: Qidiruvga mos zaxira elementlari topilmadi

source: Search raw materials...
uz: Xom ashyoni qidirish...

source: No raw materials found
uz: Xom ashyo topilmadi

# noRawMaterialsMatchSearch
source: No raw materials match your search
uz: Qidiruvga mos xom ashyo topilmadi

source: Available
uz: Mavjud

source: Reserved
uz: Zahiralangan

source: Expires
uz: Muddati tugaydi

source: Supplier
uz: Yetkazib beruvchi

source: Adjust
uz: Tuzatish

source: Reserve
uz: Zahiralash

source: Transfer
uz: Ko'chirish

source: Stock Operations
uz: Zaxira operatsiyalari

source: Raw Material Operations
uz: Xom ashyo operatsiyalari

source: Error loading stock items
uz: Zaxira elementlarini yuklashda xato

source: Error loading raw materials
uz: Xom ashyoni yuklashda xato
